# 3. Limpieza de Datos

## Librerias

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)

In [3]:
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## 3.1 Crear un dataframe

In [4]:
df = pd.DataFrame()

In [5]:
df['Name'] = ['Jacky Jasckon', 'Steve Stevenson']
df['Age'] = [38, 25]
df['Driver'] = [True, False]

In [6]:
df

              Name  Age  Driver
0    Jacky Jasckon   38    True
1  Steve Stevenson   25   False

In [7]:
# Agregar nuevos registros

new_row = pd.Series(['Mooley Moon', 40, True], index=['Name', 'Age', 'Driver'])

In [8]:
df.append(new_row, ignore_index=True)

              Name  Age  Driver
0    Jacky Jasckon   38    True
1  Steve Stevenson   25   False
2      Mooley Moon   40    True

## 3.2 Describiendo los datos

In [9]:
# Dimensiones del dataset

df.shape

(2, 3)

In [10]:
# Mostrar estadisticas

df.describe()

             Age
count   2.000000
mean   31.500000
std     9.192388
min    25.000000
25%    28.250000
50%    31.500000
75%    34.750000
max    38.000000

## 3.3 Navegando en los dataframes

In [11]:
# Seleccionar la primera fila

df.iloc[0]

Name      Jacky Jasckon
Age                  38
Driver             True
Name: 0, dtype: object

In [12]:
# Seleccionar tres filas

df.iloc[1:4]

              Name  Age  Driver
1  Steve Stevenson   25   False

In [13]:
# Ajustando el indice
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)

df = df.set_index(df['Name'])

In [14]:
df.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

## 3.4 Seleccionando filas basadas en condicionales

In [15]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)

In [16]:
# Aplicando condicionales

df[df['Sex'] == 'female'].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [17]:
# Aplicando varios condicionales

df[(df['Sex']=='female') & (df['Survived']==1)].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.0,female,1,1
12,"Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1

## 3.5 Remplazar valores

In [18]:
# Remplazar varios valores a la vez

df['Sex'].replace(['female', 'male'], ['woman', 'man'])

0       woman
1       woman
2         man
3       woman
4         man
        ...
1308      man
1309      man
1310      man
1311      man
1312      man
Name: Sex, Length: 1313, dtype: object

In [19]:
# Remplazar valores en todo el dataframe

df.replace(1, 'One')

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,One,One
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,One
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,One
4,"Allison, Master Hudson Trevor",1st,0.92,male,One,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.0,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.0,male,0,0
1310,"Zenni, Mr Philip",3rd,22.0,male,0,0
1311,"Lievens, Mr Rene",3rd,24.0,male,0,0
1312,"Zimmerman, Leo",3rd,29.0,male,0,0

## 3.6 Renombrar columnas

In [20]:
df.rename(columns={'PClass':'Passenger Class'})

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

## 3.7 Encontrando estadisticas descriptivas

In [21]:
print('Máximo:', df['Age'].max())
print('Mínimo:', df['Age'].min())
print('Promedio:', df['Age'].mean())
print('Mediana:', df['Age'].median())
print('Desv Estándar:', df['Age'].std())
print('Suma:', df['Age'].sum())
print('Conteo:', df['Age'].count())

Máximo: 71.0
Mínimo: 0.17
Promedio: 30.397989417989415
Mediana: 28.0
Desv Estándar: 14.259048710359023
Suma: 22980.88
Conteo: 756

## 3.8 Encontrando valores únicos

In [22]:
# Ver valores únicos

df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [23]:
# Contar cuantos registros hay por cada categoria

pd.DataFrame(df['Sex'].value_counts())

        Sex
male    851
female  462

In [24]:
# Conocer la cantidad de valores únicos

df['Sex'].nunique()

2

## 3.9 Manejando valores faltantes

In [25]:
# Identificando los valores nulos

df[df['Age'].isnull()]

                              Name PClass  Age     Sex  Survived  SexCode
12    Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13        Barkworth, Mr Algernon H    1st  NaN    male         1        0
14              Baumann, Mr John D    1st  NaN    male         0        0
29         Borebank, Mr John James    1st  NaN    male         0        0
32              Bradley, Mr George    1st  NaN    male         1        0
...                            ...    ...  ...     ...       ...      ...
1300         Wiseman, Mr Phillippe    3rd  NaN    male         0        0
1302             Yalsevac, Mr Ivan    3rd  NaN    male         1        0
1305            Youssef, Mr Gerios    3rd  NaN    male         0        0
1306           Zabour, Miss Hileni    3rd  NaN  female         0        1
1307           Zabour, Miss Tamini    3rd  NaN  female         0        1

[557 rows x 6 columns]

## 3.10 Eliminando columnas

In [26]:
df.drop(['Age', 'SexCode'], axis=1)

                                               Name PClass     Sex  Survived
0                      Allen, Miss Elisabeth Walton    1st  female         1
1                       Allison, Miss Helen Loraine    1st  female         0
2               Allison, Mr Hudson Joshua Creighton    1st    male         0
3     Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  female         0
4                     Allison, Master Hudson Trevor    1st    male         1
...                                             ...    ...     ...       ...
1308                             Zakarian, Mr Artun    3rd    male         0
1309                         Zakarian, Mr Maprieder    3rd    male         0
1310                               Zenni, Mr Philip    3rd    male         0
1311                               Lievens, Mr Rene    3rd    male         0
1312                                 Zimmerman, Leo    3rd    male         0

[1313 rows x 4 columns]

## 3.11 Eliminando Filas

In [27]:
# Podemos aprovechar los formatos condicionales para eliminar filas

df[df['Sex']!='male']

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
...,...,...,...,...,...,...
1283,"Vestrom, Miss Hulda Amanda Adolfina",3rd,14.0,female,0,1
1293,"Wilkes, Mrs Ellen",3rd,45.0,female,1,1
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,1
1306,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,"Zabour, Miss Tamini",3rd,NaN,female,0,1

In [28]:
df[df['Name']!='Allen, Miss Elisabeth Walton']

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [29]:
# Eliminar filas utilizando el indice

df[df.index!=1]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

## 3.12 Eliminar filas duplicadas

In [30]:
df.drop_duplicates()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [31]:
# Eliminar los duplicados teniendo en cuenta una sola columna

df.drop_duplicates(subset=['Sex'], keep='first')

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

## 3.13 Agrupando filas por valores

In [32]:
# Agregar nuestros registros por sexo

df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [33]:
df.groupby('Sex')[['Name']].count()

        Name
Sex
female   462
male     851

In [34]:
# Agrupar por sexo y supervivencia

df.groupby(['Sex', 'Survived'])[['Age']].mean()

                       Age
Sex    Survived
female 0         24.901408
       1         30.867143
male   0         32.320780
       1         25.951875

## 3.14 Agrupando filas por tiempo

In [35]:
# Creamos un rango temporal

time_index = pd.date_range('13/05/2017', periods=100000, freq='30S')

In [36]:
df = pd.DataFrame(index = time_index)

In [37]:
# Creamos una columna con valores aleatorios

df['Cant ventas'] = np.random.randint(1, 10, 100000)

In [38]:
# Agrupamos nuestros valores por distintas categorias temporales

df.resample('W', label='left').count()

            Cant ventas
2017-05-07         5760
2017-05-14        20160
2017-05-21        20160
2017-05-28        20160
2017-06-04        20160
2017-06-11        13600

## 3.15 Iterando sobre una columna

In [41]:
df = pd.read_csv(url)

In [47]:
# Utilizando el ciclo for

for name in df['Name'][0:5]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE
ALLISON, MR HUDSON JOSHUA CREIGHTON
ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
ALLISON, MASTER HUDSON TREVOR

In [50]:
# Utilizando list-compreension

[name.upper() for name in df['Name'][0:5]]

['ALLEN, MISS ELISABETH WALTON',
 'ALLISON, MISS HELEN LORAINE',
 'ALLISON, MR HUDSON JOSHUA CREIGHTON',
 'ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)',
 'ALLISON, MASTER HUDSON TREVOR']

## 3.16 Aplicando una función sobre todos los elementos de una columna

In [51]:
def mayusculas(x):
    return (x.upper())

In [55]:
df['Name'].apply(mayusculas)[0:5]

0                     ALLEN, MISS ELISABETH WALTON
1                      ALLISON, MISS HELEN LORAINE
2              ALLISON, MR HUDSON JOSHUA CREIGHTON
3    ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
4                    ALLISON, MASTER HUDSON TREVOR
Name: Name, dtype: object

## 3.17 Aplicando una función a grupos

In [58]:
df.groupby('Sex').apply(lambda x: x.count() + 1)

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   463     463  289  463       463      463
male     852     852  469  852       852      852

## 3.18 Concatenar Dataframes

In [66]:
data_a = {
    'id': ['1', '2', '3'],
    'first': ['Sandra', 'Billy', 'Allen'],
    'last': ['Martínez', 'Ackerman', 'Ali']
}

data_b = {
    'id': ['4', '5', '6'],
    'first': ['Alex', 'Amy', 'Bran'],
    'last': ['Bonder', 'Balwer', 'Black']
}

In [67]:
df_a = pd.DataFrame(data_a, columns=['id', 'first', 'last'])
df_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

In [73]:
# Concatenar por filas

pd.concat([df_a, df_b], axis=0)

  id   first      last
0  1  Sandra  Martínez
1  2   Billy  Ackerman
2  3   Allen       Ali
0  4    Alex    Bonder
1  5     Amy    Balwer
2  6    Bran     Black

In [74]:
# Concatenar por columnas

pd.concat([df_a, df_b], axis=1)

  id   first      last id first    last
0  1  Sandra  Martínez  4  Alex  Bonder
1  2   Billy  Ackerman  5   Amy  Balwer
2  3   Allen       Ali  6  Bran   Black

In [77]:
# Agregando una fila

new_row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

In [80]:
df_a.append(new_row, ignore_index=True)

   id   first      last
0   1  Sandra  Martínez
1   2   Billy  Ackerman
2   3   Allen       Ali
3  10   Chris   Chillon

## 3.19 Uniendo Dataframes

In [85]:
datos = {
    'id': ['1', '2', '3', '4'],
    'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']
}

ventas = {
    'id': ['3', '4', '5', '6'],
    'ventas': [23456, 2512, 2345, 1455]
}

In [86]:
df_emp = pd.DataFrame(datos)
df_ventas = pd.DataFrame(ventas)

In [88]:
# Merge tipo inner

pd.merge(df_emp, df_ventas, on='id')

  id        name  ventas
0  3  Alice Bees   23456
1  4  Tim Horton    2512

In [91]:
# Merge tipo outer

pd.merge(df_emp, df_ventas, on='id', how='outer')

  id        name   ventas
0  1   Amy Jones      NaN
1  2  Allen Keys      NaN
2  3  Alice Bees  23456.0
3  4  Tim Horton   2512.0
4  5         NaN   2345.0
5  6         NaN   1455.0